{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "!pip3 install ipython-cypher neo4j py2neo ipycytoscape >/dev/null"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "env: NEO4J_VERSION=neo4j-community-4.1.1\n",
      "env: NEO4J_PATH=neo4j-community-4.1.1\n"
     ]
    }
   ],
   "source": [
    "%env NEO4J_VERSION neo4j-community-4.1.1\n",
    "%env NEO4J_PATH    neo4j-community-4.1.1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Neo4j is not running\n"
     ]
    }
   ],
   "source": [
    "!${NEO4J_PATH}/bin/neo4j status"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{\n",
      "  \"bolt_routing\" : \"neo4j://localhost:7687\",\n",
      "  \"transaction\" : \"http://localhost:7474/db/{databaseName}/tx\",\n",
      "  \"bolt_direct\" : \"bolt://localhost:7687\",\n",
      "  \"neo4j_version\" : \"4.1.1\",\n",
      "  \"neo4j_edition\" : \"community\"\n",
      "}"
     ]
    }
   ],
   "source": [
    "!curl http://localhost:7474/"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of nodes: 0 \n",
      "Number of relationships: 0 \n"
     ]
    }
   ],
   "source": [
    "# criando um adapter e verificando a conexão\n",
    "from py2neo import Graph\n",
    "\n",
    "graph = Graph(\"bolt://127.0.0.1:7687\")\n",
    "\n",
    "graph.delete_all()\n",
    "print(\"Number of nodes: {} \".format(len(graph.nodes)))\n",
    "print(\"Number of relationships: {} \".format(len(graph.relationships)))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "command = \"\"\"\n",
    "CALL apoc.load.json('dataset/json_with_relations.json') yield value\n",
    "UNWIND value.OrderItems as items\n",
    "MERGE (pedido:Pedido {id : value.order_id})\n",
    "    ON CREATE SET pedido.nome = value.order_id,\n",
    "                  pedido.status = value.order_status,\n",
    "                  pedido.order_purchase_timestamp = value.order_purchase_timestamp,\n",
    "                  pedido.order_approved_at = value.order_approved_at,\n",
    "                  pedido.order_delivered_carrier_date = value.order_delivered_carrier_date,\n",
    "                  pedido.order_delivered_customer_date = value.order_delivered_customer_date,\n",
    "                  pedido.order_estimated_delivery_date = value.order_estimated_delivery_date\n",
    "MERGE (cliente:Cliente {id : value.customer_id})\n",
    "    ON CREATE SET cliente.nome = value.customer_id\n",
    "MERGE (regiao : Regiao {id : value.Customer.customer_zip_code_prefix})\n",
    "    ON CREATE SET regiao.nome = value.Customer.customer_zip_code_prefix\n",
    "MERGE (cidade : Cidade {id : value.Customer.customer_city})\n",
    "    ON CREATE SET cidade.nome = value.Customer.customer_city\n",
    "MERGE (estado : Estado {id : value.Customer.customer_state})\n",
    "    ON CREATE SET estado.nome = value.Customer.customer_state\n",
    "MERGE (item_pedido: ItemPedido {id: value.order_id+'-'+items.order_item_id})\n",
    "    ON CREATE SET item_pedido.nome = value.order_id+'-'+items.order_item_id,\n",
    "                  item_pedido.preco = items.price,\n",
    "                  item_pedido.shipping_limit_date = items.shipping_limit_date,\n",
    "                  item_pedido.frete = items.freight_value\n",
    "MERGE (produto: Produto {id : items.product_id})\n",
    "    ON CREATE SET produto.nome = items.product_id,\n",
    "                  produto.product_name_lenght = items.product.product_name_lenght,\n",
    "                  produto.product_description_lenght = items.product.product_description_lenght,\n",
    "                  produto.product_photos_qty = items.product.product_photos_qty,\n",
    "                  produto.product_weight_g = items.product.product_weight_g,\n",
    "                  produto.product_length_cm = items.product.product_length_cm,\n",
    "                  produto.product_height_cm = items.product.product_height_cm,\n",
    "                  produto.product_width_cm = items.product.product_width_cm\n",
    "MERGE (fornecedor : Fornecedor {id : items.seller_id})\n",
    "    ON CREATE SET fornecedor.nome = items.seller_id\n",
    "MERGE (categoria : Categoria {id : items.product.product_category_name})\n",
    "    ON CREATE SET categoria.nome = items.product.product_category_name\n",
    "MERGE (regiaoFornecedor : Regiao {id : COALESCE(items.seller.seller_zip_code_prefix, \"UNKNOWN\")})\n",
    "    ON CREATE SET regiaoFornecedor.nome = COALESCE(items.seller.seller_zip_code_prefix, \"UNKNOWN\")\n",
    "MERGE (cidadeFornecedor : Cidade {id : COALESCE(items.seller.seller_city, \"UNKNOWN\")})\n",
    "    ON CREATE SET cidadeFornecedor.nome = COALESCE(items.seller.seller_city, \"UNKNOWN\")\n",
    "MERGE (cliente)-[:COMPROU {id_pedido : value.order_id}]->(produto)\n",
    "MERGE (cliente)-[:MORA]->(regiao)\n",
    "MERGE (regiao)-[:EH_PARTE_DE]->(cidade)\n",
    "MERGE (cidade)-[:ESTA_LOCALIZADA]->(estado)\n",
    "MERGE (produto)-[:EH_DE]->(item_pedido)\n",
    "MERGE (produto)-[:EH_PRODUZIDO]->(fornecedor)\n",
    "MERGE (produto)-[:EH_MONTADO]->(regiaoFornecedor)\n",
    "MERGE (fornecedor)-[:PERTENCE]->(regiaoFornecedor)\n",
    "MERGE (regiaoFornecedor)-[:EH_PARTE_DE]->(cidadeFornecedor)\n",
    "MERGE (produto)-[:FOI_COMPRADO_POR]->(cliente)\n",
    "MERGE (produto)-[:POSSUI]->(categoria)\n",
    "MERGE (fornecedor)-[:FORNECE_CATEGORIA]->(categoria)\n",
    "\"\"\"\n",
    "\n",
    "result = graph.run(command)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " product                          | qtdeProduto \n",
      "----------------------------------|-------------\n",
      " b1d207586fca400a2370d50a9ba1da98 |           9 \n",
      " aca2eb7d00ea1a7b8ebd4e68314663af |           7 \n",
      " 6c3effec7c8ddba466d4f03f982c7aa3 |           7 \n",
      " 0aabfb375647d9738ad0f7b4ea3653b1 |           6 \n",
      " 595fac2a385ac33a80bd5114aec74eb8 |           5 \n",
      " b623b7cb05ee3248fbe4a6ecbeed79a4 |           5 \n",
      " 5a848e4ab52fd5445cdc07aab1c40e48 |           4 \n",
      " e0cf79767c5b016251fe139915c59a26 |           4 \n",
      " 19421075ae0b585f2dc13ff149e2119d |           3 \n",
      " 803f77475e1b51b47f1bfec4f2ec353f |           3 \n",
      " e53e557d5a159f5aa2c5e995dfdf244b |           3 \n",
      " 154e7e31ebfa092203795c972e5804a6 |           3 \n",
      " 4914f8796af2ecd359fd8f44b9b92339 |           3 \n",
      " 422879e10f46682990de24d770e7f83d |           3 \n",
      " 4aa6014eceb682077f9dc4bffebc05b0 |           3 \n",
      " c72edc98e7d77f0c4c04ec80730c05f5 |           3 \n",
      " ec2d43cc59763ec91694573b31f1c29a |           3 \n",
      " 7a10781637204d8d10485c71a6108a2e |           3 \n",
      " 42a2c92a0979a949ca4ea89ec5c7b934 |           3 \n",
      " 726b4e18f00255e2e63491bcba3f60b8 |           3 \n",
      " 99a4788cb24856965c36a24e339b6058 |           3 \n",
      " 389d119b48cf3043d311335e499d9c6b |           3 \n",
      " 2028bf1b01cafb2d2b1901fca4083222 |           3 \n",
      " 036734b5a58d5d4f46b0616ddc047ced |           3 \n",
      " 08574b074924071f4e201e151b152b4e |           3 \n",
      " 2b4609f8948be18874494203496bc318 |           3 \n",
      " 719d571299707561c34ba04ab867b32a |           3 \n",
      " f62cbf4416c9ef8e1b4e8d5279891f24 |           2 \n",
      " a1efabfd513c691eeb2650e5f04e5cb6 |           2 \n",
      " 9483476ac5b7549f7df5ff12fb6fb5d9 |           2 \n",
      " b1acb7e8152c90c9619897753a75c973 |           2 \n",
      " 553e0e7590d3116a072507a3635d2877 |           2 \n",
      " dc52f0f5d3ec37a93eaf956cde4e5d2c |           2 \n",
      " a42d9c825894f96fc6ed02610891454d |           2 \n",
      " e0d64dcfaa3b6db5c54ca298ae101d05 |           2 \n",
      " aadff88486740e0b0ebe2be6c09476ae |           2 \n",
      " 73bcea88583002fe12b7399af4ae60da |           2 \n",
      " d017a2151d543a9885604dc62a3d9dcc |           2 \n",
      " 6bf1cd252d73626ab181be470f56e07b |           2 \n",
      " a87972100f1fa4091a86d6801620656d |           2 \n",
      " e9def91e99c8ecb7c5cef5e31506a056 |           2 \n",
      " 4c2394abfbac7ff59ec7a420918562fa |           2 \n",
      " 8317b177579dd27ff068b83205e2169b |           2 \n",
      " 79c0ace2ccf0da036e787875a49151a4 |           2 \n",
      " 5570e58fb62fc2a83e5bda3974e35be5 |           2 \n",
      " bdc3291ab242ec1effc8eb0987850268 |           2 \n",
      " 5115d8cd6438c0c4d8abdf38d5d41ebd |           2 \n",
      " 685745fc12a6d4344a767bf01fb2d6d1 |           2 \n",
      " 4520766ec412348b8d4caa5e8a18c464 |           2 \n",
      " 4ce9ab528124f89e091b17d11aa2e97c |           2 \n",
      " 0fa81e7123fd0ebe03adbbe99d912827 |           2 \n",
      " 629e019a6f298a83aeecc7877964f935 |           2 \n",
      " e280caebcad1b90e624d461e53c2e800 |           2 \n",
      " 0bcc3eeca39e1064258aa1e932269894 |           2 \n",
      " 47cd48073d67f91f09cb5ef9496c920b |           2 \n",
      " 6cc44821f36f3156c782da72dd634e47 |           2 \n",
      " 3e4176d545618ed02f382a3057de32b4 |           2 \n",
      " 130482add9fd75ccb6c57ba007694a2d |           2 \n",
      " 368c6c730842d78016ad823897a372db |           2 \n",
      " 4413a608a42bd21bbf9d5abbd58c249a |           2 \n",
      " 84f5c4f480ad6c9998d6a6860f1a2e41 |           2 \n",
      " 0a57f7d2c983bcf8188589a5fea4a8da |           2 \n",
      " 65266b2da20d04dbe00c5c2d3bb7859e |           2 \n",
      " d53b2798a5e86b8db90ea3c4855cb409 |           2 \n",
      " 25f86162fee18735fffdb762dcb10d7c |           2 \n",
      " 4fcb3d9a5f4871e8362dfedbdb02b064 |           2 \n",
      " 8c292ca193d326152e335d77176746f0 |           2 \n",
      " 612c7f49d1026f7beded75464b574f81 |           2 \n",
      " d1a790e97df2101ed61553a5fc1cfe02 |           2 \n",
      " 869c418f22e0c0ed9207ff691f279e46 |           2 \n",
      " 7f4e034245e45549110139d1de248f83 |           2 \n",
      " 4c8b28305f570899b6ded964ddd234a9 |           2 \n",
      " 6bbe55cf8f85c87b6eebb775a53402f4 |           2 \n",
      " bdb4be6ce2f7f2b5be0a16088028c7fc |           2 \n",
      " a5ae8400fc9fcacd4af585a57bbf264a |           2 \n",
      " f40876e0ef3cd5f9132b1f16b04b1346 |           2 \n",
      " fb55982be901439613a95940feefd9ee |           2 \n",
      " fe75529a267b76ac6e96f0c322a899a4 |           2 \n",
      " 17ad136b7421ea8690fded631b651158 |           2 \n",
      " c8f57335e06d8d4e73e34057dc92cfbe |           2 \n",
      " 419cb1b441eda9b92ebd1a1b96090c26 |           2 \n",
      " 8bef2f3e34f2cc22c908921e6e9eebee |           2 \n",
      " 414c53fa9c5cc4a0390682aeb2e25ec1 |           2 \n",
      " 24c66f106f642621e524291a895c9032 |           2 \n",
      " a62e25e09e05e6faf31d90c6ec1aa3d1 |           2 \n",
      " 165f86fe8b799a708a20ee4ba125c289 |           2 \n",
      " 8f8cb7e4a7f16d339f87f8aa2711a003 |           2 \n",
      " 617186c3d97ea56c9c683a8a3974e8c1 |           2 \n",
      " afeeea6271148ee1bb15173b8187c431 |           2 \n",
      " 1a080577618e7fe4d9ddd8fb2b47a964 |           2 \n",
      " 813a30050677eb6996e12eea9ad400bf |           2 \n",
      " 6b64362e89896be7589621df54be089e |           1 \n",
      " 111d0b1e69f349615615113cf6b275fa |           1 \n",
      " e090b9bd2ef7d60d3b0ee3399c79ee3d |           1 \n",
      " 59a6f4180469806670de7814d503202e |           1 \n",
      " 6d3dc397c315b4afa15c2cedda354740 |           1 \n",
      " 2629c2e1e3a0b360912763741f1bb7ef |           1 \n",
      " 0cb9f521598f339ad6e6b41e34a1b169 |           1 \n",
      " 5ef700515181623872771a16d1371cd4 |           1 \n",
      " 1ec486885049bbb9b79351d150ed18c4 |           1 \n",
      " 7859f528174ebd0467278f357d67833e |           1 \n",
      " 3d5837f86205fe83f03fb5f7e4d5b9cf |           1 \n",
      " 3c12d600fecb7aab3c4e4cd7755f1de3 |           1 \n",
      " e82b2802625252b6d72b3e1d36f82670 |           1 \n",
      " f7c72fa5d77c897b79b13a5f86f27b02 |           1 \n",
      " 41150780d8eb1857e9575c5e3c23c0f0 |           1 \n",
      " 401b5632c06c51319df083f1245a96ca |           1 \n",
      " f98ab3dc92c46ebabdc8f613acfae537 |           1 \n",
      " ad88641611c35ebd59ecda07a9f17099 |           1 \n",
      " 8c96a6969d0fad20629fec9c1ea45e02 |           1 \n",
      " 6e835aea84ae8eb68b8c14878dd43b30 |           1 \n",
      " 0adf970bf07772b0f8c88f664e146221 |           1 \n",
      " 1a3c44587dd8d3db5f2447078bc50d75 |           1 \n",
      " b126c36658d4d8ae320a4ad38531cbaf |           1 \n",
      " b5e13c9a353102f79c6206ff5cb61a50 |           1 \n",
      " e482ad963bfb9a9abc51b9850aca97b7 |           1 \n",
      " 1ab301df9ab26fc25842366a7c68fb96 |           1 \n",
      " 22dcd61aae0f6d1acc992914bc67a0e5 |           1 \n",
      " 657491063e8a63247a108a4d9cedf020 |           1 \n",
      " 38481079a1b7b615e150e2dc4d257bd7 |           1 \n",
      " 3225c54bb2785c33f49f50398fcdb88c |           1 \n",
      " 487ff90293c6b5484d060de3fe409557 |           1 \n",
      " fef11bcb9bda869da356243b240c07b7 |           1 \n",
      " 017692475c1c954ff597feda05131d73 |           1 \n",
      " c95ef8ea078a841a370c7ae96a552711 |           1 \n",
      " 0292b46c30348496b1be04eeb440bdb5 |           1 \n",
      " 304104a478e3a605db6072a22e4ee228 |           1 \n",
      " c10426af8413edc42015b10a76b43651 |           1 \n",
      " 7cb5b984262835ef46a1ed83d04d0d44 |           1 \n",
      " 5727b4e9463bfa0b43bf97397c4b7c44 |           1 \n",
      " dd4c3b4ab7e001aaf385ea2e68952030 |           1 \n",
      " 8dfb03487cbe37c4d46e3e372a7df1b7 |           1 \n",
      " 98d893a81a1845b6f278f33eee0a4f36 |           1 \n",
      " eb6b82b5e0758b2710c52ef65ffad74d |           1 \n",
      " 48428054567e07738a70f9d2a9fa0475 |           1 \n",
      " 134830b1415ca0fa9d9f413259e1bcfe |           1 \n",
      " 122ed0b5404fb93c07b3d35c99e8aaa9 |           1 \n",
      " 5e015730deea7dfbee442adfb1e29b27 |           1 \n",
      " e8ad45ffa4260bf3a9cb60de28341924 |           1 \n",
      " ca94d73e8f12ba9a6393af8224536f90 |           1 \n",
      " d1847c3f994dc0bb4d1248520ecb81f3 |           1 \n",
      " f89d2b130b571d24532514dca6fee2a8 |           1 \n",
      " 63de2743d05ab59d85caa49e49459ac1 |           1 \n",
      " 7d1a667dbc183583078324f912d42c6b |           1 \n",
      " 542b3d80712d51eefe3a3cd1c5f4e8fe |           1 \n",
      " f89cd865cac300a9bf1320dd8f0fa223 |           1 \n",
      " 31c4cfda24c7c817aa9761fa55185dd2 |           1 \n",
      " cbe9e2a7ae078d6055bce05a0b9ad8b0 |           1 \n",
      " dd330cda72d57600ab101aafafc9ab22 |           1 \n",
      " 725e77eb7923719a251e7a4bd196ca6e |           1 \n",
      " 75b4372e69a42f8ae1d908c076f547b2 |           1 \n",
      " 8973d773c115b9e347c34a248f17bc92 |           1 \n",
      " 6bc8dadd7731eae110fe2d177361784c |           1 \n",
      " ee4a5109a6b0bf0dd3a3347b73955c95 |           1 \n",
      " 0f24b7516c5b67c9c686848db9759d88 |           1 \n",
      " 78a2a96601d7940594f95dbaa4c368d0 |           1 \n",
      " d12ad7f92749db41296a64e02c0bd5c8 |           1 \n",
      " 9a29b754b7fc0aa8eeb990103fcea4fc |           1 \n",
      " 7814c273ab16783d73a9863ebfa8b141 |           1 \n",
      " f9ce5e5592c6836c379b156a1b043684 |           1 \n",
      " e307200b995cf8d99d85db7d09e4ba00 |           1 \n",
      " a6ad77b15e566298a4e8ee2011ab1255 |           1 \n",
      " c876dad8e599989a907ee3b09c68966d |           1 \n",
      " 6fd3f7378cd65325e10cb21733778416 |           1 \n",
      " 380b4664ba5bb18cc9db78ee6bac3558 |           1 \n",
      " 15557c53492889a2b63e65df34a738ab |           1 \n",
      " 81d879a43537a2803762ce12282ccbc9 |           1 \n",
      " 0efc91aa52d1f0669126d3000a94279b |           1 \n",
      " aa2f410b8f9a8e3e6320540174a4edfe |           1 \n",
      " 32ce8729ae3e7d91243934373ab532ec |           1 \n",
      " 41cd333a4af5e36df81fc0b83ccf8e2d |           1 \n",
      " 948cf1d0e3086dc58ca7332b39abda1d |           1 \n",
      " a6621d4ee609f3f917d04c11ca8f0161 |           1 \n",
      " 7f7da198305ad62091daf841ed6acc6e |           1 \n",
      " 57a2e16f66595e9242fd508a9f336125 |           1 \n",
      " 72fd27ef586cb111f4a1364a61734a6c |           1 \n",
      " 1f413d93546f7ee41457fa988ddd82ed |           1 \n",
      " d26fcc1c248f5f9f8340e6061bf1f2b5 |           1 \n",
      " 0b0918a3b5efe0c8ea609a26b14e1bff |           1 \n",
      " 633a2a64a6478966e0b6805ea708de58 |           1 \n",
      " dda373e611cb942842a1c248b163c3aa |           1 \n",
      " 88c20c5a22f2ca169af8cfc2df00a7a2 |           1 \n",
      " 4b26e5a29c80bb0a05e5094928a97537 |           1 \n",
      " 04ea859686940874c6f624314a14070a |           1 \n",
      " 7f064525eaaa1ce9d22c085f7ff5413a |           1 \n",
      " c8467740c17bad8744006eb0e041f142 |           1 \n",
      " a266930db2217c102cb34cb715b5d479 |           1 \n",
      " 7614c62b86a81021243e438cfde78ccc |           1 \n",
      " e57eb018e37376580079825eb29a3419 |           1 \n",
      " def347b50c7dcc58410c7d66d14b87b4 |           1 \n",
      " 49770e2e1a22b61e15a13c2cbfbfcbbd |           1 \n",
      " f2e53dd1670f3c376518263b3f71424d |           1 \n",
      " be127a8a979cd5d591ea345f10bba28c |           1 \n",
      " 6931796bb4e63c4dd0919290c8cb699e |           1 \n",
      " 1cee940750667f29c969974d268656f8 |           1 \n",
      " 20fcf54ae3433ede318a3587bfe559c4 |           1 \n",
      " 63094ac128b54dd72d511043411df079 |           1 \n",
      " c77b5fed1d58641e0f5e70cefd093a62 |           1 \n",
      " 9aa9caee155847cddb376a05b9a39791 |           1 \n",
      " cdc4af478fef19f03f1d0353c00271cd |           1 \n",
      " 1a28b6d0eb91221f9b752c533f9e0182 |           1 \n",
      " fad534edb8f35664713c4b766fa473d4 |           1 \n",
      " b4436da747c3a53ab07ac0e71de17dcd |           1 \n",
      " d71dee111aab947d8d1216505f130d8e |           1 \n",
      " c0a3d13743c894a0bd017a85acb658f3 |           1 \n",
      " 671be61e4013fc77e2d3586ffc1e51f1 |           1 \n",
      " b5d214651360e2d58e13b48ae69c6199 |           1 \n",
      " 9d72e48d483b01cd07024793995aa30b |           1 \n",
      " 6a057a401eab3b3cb8083d9e42972233 |           1 \n",
      " 1c9b5793de6c3d9117b6218552c87a8f |           1 \n",
      " 2f5e485bacfeb554bec55cd497c9bc51 |           1 \n",
      " a1b156a0925874f584d8d0cb45a962ba |           1 \n",
      " 527a40078203cf108551cf90f6e3b018 |           1 \n",
      " 0988b623cb8fe96a92474a96b0573503 |           1 \n",
      " 4b96786612ebe7463132fce2c4dca136 |           1 \n",
      " 9d395a6bc9dbad2dfe60c8c92d8df397 |           1 \n",
      " 3f29ff76d9ee5fd080b96ce49afc6c94 |           1 \n",
      " 001795ec6f1b187d37335e1c4704762e |           1 \n",
      " 9c3e030eb36047b2a7610a613b945642 |           1 \n",
      " fe406983ad8b9e20a5b18801f39ece27 |           1 \n",
      " 36908dfc3aabeafc9039dc2365586c0e |           1 \n",
      " 4eba76ab901d06e619d8d7ac69b3579a |           1 \n",
      " 87ac501420e10a4e559d1094f172eb63 |           1 \n",
      " 138dac44dc568cd36c6f1d1e5e181d5d |           1 \n",
      " 566aaaec94561903dba698b1ff3cf459 |           1 \n",
      " 905b384ac5667170689505bbf30f1d07 |           1 \n",
      " dca8cbb1c9d8a2db0fbc0c36b8d1a7bc |           1 \n",
      " 85d8ae64b3b59814a1136254a96f5693 |           1 \n",
      " fa80471d26662bb653b2286e4b735a5a |           1 \n",
      " a0458f75b62b1e812480c0c915d9b649 |           1 \n",
      " d7d5562fce331ad958ca6f57057b3526 |           1 \n",
      " f78d57eae3aa976bdfd5f0db33141a79 |           1 \n",
      " 430f4c8e02bd4e1fe6330c38689b54f3 |           1 \n",
      " 14b47a66430c89500f18cdaaef9e0c21 |           1 \n",
      " 38fa750a3a3b3204f169c86a3284d387 |           1 \n",
      " 2947c2678aab0b7bfc86dd062d9c3318 |           1 \n",
      " 2f1927c926303d27159849d2601d5d96 |           1 \n",
      " c1a940820f1f674fe52265f700f72302 |           1 \n",
      " 0e56789eca7cb6089cbcb26cdae08012 |           1 \n",
      " 029e44e66d4690b45077bee6d76799f6 |           1 \n",
      " 6b7c7bc412636b6e82fbb11eb157df21 |           1 \n",
      " 84ecc25f4c77dacc5c0ceb89e09492e9 |           1 \n",
      " c8894c0b162237058026ee80fe6a6f56 |           1 \n",
      " 492bcf01a7a40c8fe5c720574dc786b3 |           1 \n",
      " 656e0eca68dcecf6a31b8ececfabe3e8 |           1 \n",
      " fd45ce2fbdcaa362dfb5d1a21e87a711 |           1 \n",
      " 2a97ccde48b4f516a7a76352d03eff88 |           1 \n",
      " b9518f0140a3efddd3c1ef9ad49d23d8 |           1 \n",
      " 83f92096793dec6fa40579e63590c90e |           1 \n",
      " 72a2153c4d20cfbcdb7f75d9c39f5814 |           1 \n",
      " aef5dacb8cffba210a6e307dd01e4923 |           1 \n",
      " 85df978207ed4024ea16570dbb64fd6e |           1 \n",
      " 4ba501db540524d84cc382bb041ac508 |           1 \n",
      " 84a5ff7347e4371b23168a1b69f2409d |           1 \n",
      " 44d097d59e8430f88a67517cd0c4f865 |           1 \n",
      " 5f504b3a1c75b73d6151be81eb05bdc9 |           1 \n",
      " ab1f9387c0627dd24000bfbc54fdeee0 |           1 \n",
      " 22f799df8d5495f40f6ed3cc8b18b712 |           1 \n",
      " 44053ed0088d0655ed338810cd2d4d51 |           1 \n",
      " 83bdb5c63669bd89033937be3c4708c1 |           1 \n",
      " 8be128ce3f51211048f4b891e9303381 |           1 \n",
      " 1d4de03a6141ce2a2ae5a97f51cabb37 |           1 \n",
      " f57d7420f086c47b2fda2115ecfbd2c9 |           1 \n",
      " c4444723412f21a52a81a4c14eadc0fa |           1 \n",
      " ef5c31aee1d5074121a478b14d3eb50e |           1 \n",
      " 8b1b115b8dc96bdfa740d4267019a201 |           1 \n",
      " 2d110366dd24a714cb50dddc30b4101c |           1 \n",
      " 73633011389f961c581431b839cfe9e9 |           1 \n",
      " 30ac6df06dc59ad72cf2f158fc2d904c |           1 \n",
      " 30469bb5ea377eae7121981e2f0778e4 |           1 \n",
      " ad251378b8a5df8ebfca21e28cc01d6f |           1 \n",
      " 4e064cdbe4079c84a33181a96cf5609b |           1 \n",
      " 487fb870bc96e50a68b9428f30649c72 |           1 \n",
      " 85f7542f664dc1afc5942aeee6825368 |           1 \n",
      " 2002fc3ec2d8a30a7588628fe7aff958 |           1 \n",
      " a0a6b0afd47416d62bb25892c68b6296 |           1 \n",
      " 67210f2751a0c0aa78d46d9513abc836 |           1 \n",
      " dee46ab618429cbd3cdf24b2eb4c7f34 |           1 \n",
      " fec3b45dc09b257690a09a742870b149 |           1 \n",
      " adb6a21f7a3c42ae1c2f514a1deccd3e |           1 \n",
      " 7f72a8900b3d2fc8fa2635b7836d6e6e |           1 \n",
      " 5d90b82ad1fdff812987fa28158b7984 |           1 \n",
      " 0bf16c5642f26022d106438f491b9b1c |           1 \n",
      " 06edb72f1e0c64b14c5b79353f7abea3 |           1 \n",
      " 592962829d5a715304344e656e39108a |           1 \n",
      " fdbf9f9491572857107621c9e0c5d59c |           1 \n",
      " 983b5668afc4aa8777599206fcc8964f |           1 \n",
      " c8a06a6cf1dbd09f3273d65d3dc2da99 |           1 \n",
      " da023890ca0515244ea89dc905faceba |           1 \n",
      " b98546b83abd474d9517e36a1eddbc22 |           1 \n",
      " 56f096959d0abfbb601eaf570323d766 |           1 \n",
      " cda185193c72c0eb8dde03f20f101230 |           1 \n",
      " dbbda25f6b7c74669cf2203b2e3139a0 |           1 \n",
      " b65d35a9df9e9824ef0ae175b9468161 |           1 \n",
      " a893bc71728f68147175c1535d952357 |           1 \n",
      " fe6a9515d655fa7936b8a7c841039f34 |           1 \n",
      " 10d196ec072e2d8382c7ec9c942d7ea8 |           1 \n",
      " 8c5876b1c7768217964f353bc7e64393 |           1 \n",
      " c18dfe3165eaa55de9ec8f462cd7556f |           1 \n",
      " 53d2c16e7356d124bb2a3f64ca920754 |           1 \n",
      " 3c5ba90e09547db90868e803d139de30 |           1 \n",
      " eec68ed7d496bb2ee6aa0a69bb78acd2 |           1 \n",
      " 480c9e1ca446baf8388f0eda5300b25b |           1 \n",
      " be75efb07aff79cef2eec7ddc5de3952 |           1 \n",
      " 8a1583ef3ffc9f4b5bfb7b78e74f4c9d |           1 \n",
      " 393564b0bcdda0d8c4ada9d780ebcebe |           1 \n",
      " fe61253e50ad6ee9f1d180da22ce5eef |           1 \n",
      " cfe99a31516679fb9515881d25891570 |           1 \n",
      " 55b04296824029ae20bbeb3b200e69d0 |           1 \n",
      " cf6db73155e09a3583117d7dbeeab445 |           1 \n",
      " bd7cd34fc6d02e730221b11edc354aae |           1 \n",
      " 999f8a403c25d68c828a6915e13e89d9 |           1 \n",
      " bef6177f54efb9a6218e124b629fc152 |           1 \n",
      " 68e2f443d819056e1a6b7b29729f7bb7 |           1 \n",
      " 8d9d31dc8d8c05062987d883cefa98be |           1 \n",
      " e85cdca8790ea0026ddf7316f469608a |           1 \n",
      " aea8161ed6bc3b11628cd393fd03486a |           1 \n",
      " 016711f78a6a87696645db0a6a834826 |           1 \n",
      " 68de8d992d087d6b480879f43b178c98 |           1 \n",
      " e878662b68e175a58b5951e44574d5c8 |           1 \n",
      " 0f3de29f8370072525a20385ebbe889a |           1 \n",
      " db25a58a5da5dfe2fd19f2604491bd27 |           1 \n",
      " f4f8823fb84272f90fd1311532effb71 |           1 \n",
      " c9c455f9fd8ca66d3ff7f90a249753b4 |           1 \n",
      " bd6e6fce9ada76ea2db0f1912e8e478f |           1 \n",
      " 4cac1a12a6fe9ffba4a9556dbe582e28 |           1 \n",
      " 3e9b58f1436820c248d3f98d7229bb14 |           1 \n",
      " fac45b7ba2d8cbbf4d7ab67256745106 |           1 \n",
      " 6db41bd5a650ed247a5690c0e78c3969 |           1 \n",
      " 819386cf1eea26ae023a2895cd2f73d1 |           1 \n",
      " fc44aa56f6950438772a08ec23552fd9 |           1 \n",
      " de17feec1983829fec4bc58cadaa43f3 |           1 \n",
      " 5f315c482ee138f3766f5a9169f16ba6 |           1 \n",
      " 99b7af24fd7be364e3621b9e751b048e |           1 \n",
      " 0f5332231359f783330b784af1b8c3bd |           1 \n",
      " fad824f446c61e0e6e1e8644c17a9f59 |           1 \n",
      " 0c9ff9d8ed9b9bdd825487b3a66e05f5 |           1 \n",
      " ed836edc15625c202f6ba85dbbe95c3a |           1 \n",
      " ec02a5d380128f7a188e9ce8f3ddd832 |           1 \n",
      " 1d9263e74c3e8e57d3a7bd505b7b871e |           1 \n",
      " d2347fba1e60ea51f533960fc555baff |           1 \n",
      " b62a475bcfd309c66d84a1a93aa75fd8 |           1 \n",
      " 491c6b0ec61399a890b22a6ed2d9a4b0 |           1 \n",
      " f16e5b7883c1349e57bc5e92ba9e0d96 |           1 \n",
      " 281bbfe70848e0b304bef88fc2caf2c3 |           1 \n",
      " bed81d82bc7b0333ace331d5e70e1bd0 |           1 \n",
      " 5232994b2d1d55105b92d445d97d0f62 |           1 \n",
      " 9d6580f17a0cba74324ce82874fbbe13 |           1 \n",
      " ad2037645597db38527fe3afbe226af2 |           1 \n",
      " 9823e38ee143a67b94ca6c264e2c91e6 |           1 \n",
      " 7b35ccd93a2184646c03b70326626923 |           1 \n",
      " 98b22c1129886cbd7fcae69d1c93e442 |           1 \n",
      " f908d3bf313a1308bfb2a46ea2685347 |           1 \n",
      " ff5d87897ed26d564711df324b98ebee |           1 \n",
      " 34774dbfa36fdfe7225c6c68293b694c |           1 \n",
      " 51f876eb62be778c757503cf7f8a3b74 |           1 \n",
      " 764292b2b0f73f77a0272be03fdd45f3 |           1 \n",
      " 289b15aefdff679d218b286e195e8f22 |           1 \n",
      " 10dfb99fdae9b721c39b7458564397f6 |           1 \n",
      " 32459442f3b850918e20febc47c9edfb |           1 \n",
      " 1a1607ff3b9bced214efc0a8cdfb2510 |           1 \n",
      " aa49abfbe4f971849628bdae6a7e5efb |           1 \n",
      " 635b74f3dd5462e3c133b42cd9299fa2 |           1 \n",
      " cc971e0365873137b8bef2ebad633e6f |           1 \n",
      " 3c516e321c28ec378c4342e1845c4332 |           1 \n",
      " b992409279b9ab0681b346f1e551ff8d |           1 \n",
      " 0009406fd7479715e4bef61dd91f2462 |           1 \n",
      " 62d41a80c366aa2d8644e3270adf8440 |           1 \n",
      " 99d48e31cb95ab20a319faea37066bf0 |           1 \n",
      " 2b80699b25d49f30774b88420a36c55d |           1 \n",
      " f2399cabe080029634d12cec4f60dbf0 |           1 \n",
      " 23bcd6822a33df5534f9b290216eec1f |           1 \n",
      " db0b761c0a07642146c6df824bb8789a |           1 \n",
      " 8a443635fdf9759915c9be5be2e3b862 |           1 \n",
      " 4ebb87ba41ca446326804d0e7f8dcc93 |           1 \n",
      " 02475368dfb38934fe55f574024fe1d7 |           1 \n",
      " 924b2122bcd5d6eb53d37a167d3b1d47 |           1 \n",
      " 5c692818d313aa12864b48ac0c2472c2 |           1 \n",
      " 3a081630438070b86de554fac9edcc7a |           1 \n",
      " 2f46e035eccda1e1e2127096bb7483e7 |           1 \n",
      " b0517edd4454b9c2537f65826f500a2f |           1 \n",
      " f837b6a7e6740b19b2fa33c267fd8e7c |           1 \n",
      " 1a4abdf8e4e0329e516e6e55260bb1d7 |           1 \n",
      " 19ac68e14d04f4207dda95e2fd44a960 |           1 \n",
      " cd48f265a63e13b762601f5f794c5fca |           1 \n",
      " 9e4a852f41aff52bafff133d9deb5eee |           1 \n",
      " 246aa84ea966f137a2d87ef0041fa6ef |           1 \n",
      " c30302f36e15f43c1b85c9cb002028d5 |           1 \n",
      " 58e3e57e37601dce8a567e7c1f9e2090 |           1 \n",
      " 062c203528884afcf5ab3bcd04593f51 |           1 \n",
      " bff35d3572b474e918bb0780723240bb |           1 \n",
      " 0654d3c1e3efc7e7cd9dbde9cb743df2 |           1 \n",
      " 51ce083cd2b9078656a94655ab45b8a4 |           1 \n",
      " b28a05b86542471543370c2399f04fd3 |           1 \n",
      " ee286d9b47b21317f08ef31202f0debd |           1 \n",
      " 121b9686b9929855d823981fc655a6fe |           1 \n",
      " f39a8b27ce90ac582103bf36f09690dd |           1 \n",
      " d696750e550fd0f733979dd7e5dff921 |           1 \n",
      " 62c89abe1afe3a23c17765d462718a4c |           1 \n",
      " e4f3a10338ad9594098e83015a3a7c6b |           1 \n",
      " e424f69523d159f82480c01a1ebf9f7e |           1 \n",
      " 8060b4a1aeecf25a9ada1fc0f6e142dc |           1 \n",
      " 68c7b730377e83ef83e053ca3785b8d4 |           1 \n",
      " d16a25f576e1296fd955eb4136323f21 |           1 \n",
      " 906b11f3bc3c98f883afa0eb67b0fac7 |           1 \n",
      " 24a014458ccc6e989b4fcef5fa71da58 |           1 \n",
      " 17704da54fb7512da5a72cc3b227185e |           1 \n",
      " 0a790f2710eab03be4f7793583779874 |           1 \n",
      " 20090bcd0d43eb49feb63d53d387780b |           1 \n",
      " 211293b50935ced8d4370f552c482d74 |           1 \n",
      " abaefce0c17047c6829ff4078f2005d0 |           1 \n",
      " 35afc973633aaeb6b877ff57b2793310 |           1 \n",
      " 72b61ed035f5576359ccf0d2ec7bddf2 |           1 \n",
      " 382132cf96c88a277a65226833af5f61 |           1 \n",
      " 173d5a1b6c4ea4f41aafca840646d240 |           1 \n",
      " a076986c6dbcb66fb479167aa5a1b68e |           1 \n",
      " 7d9b103535d14aebdd1024a6684ac2a6 |           1 \n",
      " 11250b0d4b709fee92441c5f34122aed |           1 \n",
      " 67ee002d7de2ab248bef398033830866 |           1 \n",
      " dee98cc0394b12aefccbad334b415c10 |           1 \n",
      " 86b8032cbb666ec9ca1f2aa4d4cace06 |           1 \n",
      " d07c0177e489e871713b83a518446ac7 |           1 \n",
      " 165cf891cdb818da8293163bf0a9b2ba |           1 \n",
      " d2c7a1e57b8f3e74095798f867334b36 |           1 \n",
      " 5b3b5f9ae84ca9ead3138b199420cc94 |           1 \n",
      " 27d0fc55e3d2fe698088f2603e0a2ab6 |           1 \n",
      " fc22eb7bba78fd67da33c9acf162d592 |           1 \n",
      " 17da5d80ea0eeabd565083183027d588 |           1 \n",
      " b2572a992f6ea1d1a7eb518d54e64620 |           1 \n",
      " d6354128c28cc56532ba7393d9373083 |           1 \n",
      " cad39e71c0fe2f6ce875040d4ac43a4b |           1 \n",
      " 04601b648d7d2dcae6e285a41e276a3f |           1 \n",
      " 616042729c11849827291496b18e9ec5 |           1 \n",
      " 73ae8d8ca7df19a982c92fc1265d9e46 |           1 \n",
      " 835c3918777f6ad40fea5150f5ba0cfb |           1 \n",
      " 4fce0eab61e01d521044c8b071cdfead |           1 \n",
      " 305edcc7b46afd87ca6979ed0409fb09 |           1 \n",
      " f48b3c028081f637a45e3374cf0061ec |           1 \n",
      " b944aabf1fc45c01599ee96c7f4d533e |           1 \n",
      " 5d9b91e8dc83f3caa1cadaf14cd68660 |           1 \n",
      " a52ed2fb26d435066d6613134afcb439 |           1 \n",
      " 0c8b6b6e4f9ee5fe2c48d6cee4c69bc8 |           1 \n",
      " 251876e7ba013b87b7262fb2524e2d60 |           1 \n",
      " fd206f3c185fd47c22d6de48f25133fe |           1 \n",
      " 8215db96a612d69839c27866feabf350 |           1 \n",
      " 1ed65bd74fcdbc4b99bc838f1b8583e8 |           1 \n",
      " 2d6b812c811ee4ef384bf40877c73706 |           1 \n",
      " d2dd851308d9f2baca67043df303d36a |           1 \n",
      " 5a76b277c6c31033b89362512fb80274 |           1 \n",
      " a64c80ae3742add8f6a968d49badf726 |           1 \n",
      " f35927953ed82e19d06ad3aac2f06353 |           1 \n",
      " 52a0ba432dc806e4be2fd5cc224208af |           1 \n",
      " d6bbda35f0b8505c2f824f1d90295855 |           1 \n",
      " f5bb0eef3914b07a9dea355a6a3069da |           1 \n",
      " a659cb33082b851fb87a33af8f0fff29 |           1 \n",
      " 3d48e45c02063f74b3a9147ce7ab5196 |           1 \n",
      " 4652e11aee23d86203400f6094fbe8bf |           1 \n",
      " 17f2685e91a49b99540dcb684ee7d94a |           1 \n",
      " 293637be1a5ab3bd138fb6b758100e7c |           1 \n",
      " 05d80513da078badb81a5f232e489376 |           1 \n",
      " 5ed9eaf534f6936b51d0b6c5e4d5c2e9 |           1 \n",
      " 7c6ff274f0411bde88f5df8db5f64693 |           1 \n",
      " 01c9a70868bec5b748c67fcc26ce5895 |           1 \n",
      " 3eef0cb94ba82de806bb30ab743c7655 |           1 \n",
      " 568e52d4c670b4d5130bae2dbf211c40 |           1 \n",
      " 7b3baec97c107a6869809313ee7262ac |           1 \n",
      " b99e4f4fa3f421e0ffbd512d9f152dec |           1 \n",
      " 73353895a654703808e8ac484d6abe20 |           1 \n",
      " f0f719ace174d68fdc838d8d6c4ce26e |           1 \n",
      " f08c59bc335a381d2b015c4efdc6dae3 |           1 \n",
      " 371c121dc86b3821f720e7dbe1928207 |           1 \n",
      " 362b773250263786dd58670d2df42c3b |           1 \n",
      " 4945f34d8df378693f6b84c437b414dc |           1 \n",
      " 0030026a6ddb3b2d1d4bc225b4b4c4da |           1 \n",
      " 0b33e28a934b68a0475650499b9ae509 |           1 \n",
      " 4fbee589d3377144a90a338e4ae76dce |           1 \n",
      " d69f56b9e4b6d98bc1521db5ba96846a |           1 \n",
      " d04e48982547095af81c231c3d581cb6 |           1 \n",
      " 465af64ab23573e4e48c31bcc099b801 |           1 \n",
      " 777c0b09022d68979d7c489251a4c7a0 |           1 \n",
      " a2105c8c0d5d99dbc5a2a9ad94321e5c |           1 \n",
      " 94950d6ddd0b24c0d15f7f09d61a8148 |           1 \n",
      " 001b72dfd63e9833e8c02742adf472e3 |           1 \n",
      " 60a8d8f0434c4531bf310eebf9f19cfe |           1 \n",
      " e30aaafe45e34ce07003ef0cfcb6e49d |           1 \n",
      " d4cbb6517d22b1d8114cb1dcbd40cb25 |           1 \n",
      " 586d2dcb4ad3f344da859b44a01d2080 |           1 \n",
      " cb52e6775d816cbdadade36948e81fc8 |           1 \n",
      " e2a874b1b8340b4038172b1925afd914 |           1 \n",
      " dffb26377d60bf9bd5bd4cd856e9dbb4 |           1 \n",
      " 84bfcd3c1a4f15e9bd5867a775e232d9 |           1 \n",
      " 1b7c03297b91c3accb749dfadbac7bbe |           1 \n",
      " d3a1e0ce5009f1a816a6ba558908fdf0 |           1 \n",
      " 446f791c0261ad0a93d4dced49d5d0bc |           1 \n",
      " ffbc83054b3741a8d67fc59d9cf9d42d |           1 \n",
      " be5f0f785e9495b018017045cc207457 |           1 \n",
      " 12760bcacfaaf1457bc36e601e26dc79 |           1 \n",
      " 1cdfaf0cc5abd6063d3a10ae3318f345 |           1 \n",
      " 37cf51a1aaaf1d36fa54d980867b6fbc |           1 \n",
      " bee2e070c39f3dd2f6883a17a5f0da45 |           1 \n",
      " 635da37711a6b8a8adffc07ab6a5c9b0 |           1 \n",
      " 878e6a7350b5ddcf85419728d254e1b2 |           1 \n",
      " 312deeb177508f3b29f7ea944719b267 |           1 \n",
      " f727147ccedba9da38dc2ab8b496a444 |           1 \n",
      " 13387d462f74993d258b62f8f85fd9b8 |           1 \n",
      " b76364870c38ddd7dcc9dd9ab5abeeb4 |           1 \n",
      " 4cafc445fc7535c3b41b8978c0ce68dc |           1 \n",
      " 236f3599e6d57eeb5eb9535b2c88b231 |           1 \n",
      " ab52c2c44ec8bebc9559a03ec12c8eec |           1 \n",
      " 24d8da2d499efba175b1092826b7e390 |           1 \n",
      " 71835d687609f578b92692f98ab16100 |           1 \n",
      " 120fa011365fc39efe382cba4e50999e |           1 \n",
      " c3b9c5a3a88d5cd18800fb865741d9ad |           1 \n",
      " dcfe76be1e1036cb99e5d8bdc2a1b1c9 |           1 \n",
      " 8a2fde854a6f41aae89ce99303a847e8 |           1 \n",
      " 8557bd1de3672759c2c9321b349c32b1 |           1 \n",
      " 5113c9a5037013b0a750444df6dec60f |           1 \n",
      " 90ff2ab522c1346e5f5e2c785a6ac3ca |           1 \n",
      " c59f580bd1844c1f634ce410bda0a6ea |           1 \n",
      " 809ab2033b8267fc321860bf0d4dbb11 |           1 \n",
      " 6ddc95e87149457c4c5177b0a474a9ba |           1 \n",
      " 28a652ff04e43c1bc57937a9f8770f9b |           1 \n",
      " cbd63fa909c967a6416090f22a76abd8 |           1 \n",
      " a50acd33ba7a8da8e9db65094fa990a4 |           1 \n",
      " 46292acbc08d49b95138891146f7287b |           1 \n",
      " 663d6ef343ce527b3548d6a255f89eb8 |           1 \n",
      " 652698dafbccac29d78c7ba70dceef10 |           1 \n",
      " b296b1ee06b6739f8bc6b1d41d06dbe0 |           1 \n",
      " 51e8cb2e53573210345e6b2f0168206c |           1 \n",
      " 30e538a84e5ed6276d0ef5dc07bac435 |           1 \n",
      " 6be1dff0cf8ff6e347589c05db1394d9 |           1 \n",
      " c6aab69ca5c62eb16eafaddf36c38ccd |           1 \n",
      " b01d34f6d2545269d348181768eca049 |           1 \n",
      " 1a758361b1c10b3ffe3d3373332de319 |           1 \n",
      " 411fad26ce07a5a611883f05fb5798cd |           1 \n",
      " 8814a3da37fb9673a5ac06f82a2a00a9 |           1 \n",
      " a35c14eaa384acf7aabbbec3bd76fae6 |           1 \n",
      " d5140e1d258c83a340419c6522c7da22 |           1 \n",
      " e940125d0a3c309f58f41cd21e39af06 |           1 \n",
      " 0a9a9c25c5a06532d1766e00db833a7f |           1 \n",
      " ee0c1cf2fbeae95205b4aa506f1469f0 |           1 \n",
      " 0a74b9407eaec9d6c760a1e92c10d96c |           1 \n",
      " fbc1488c1a1e72ba175f53ab29a248e8 |           1 \n",
      " 72d3bf1d3a790f8874096fcf860e3eff |           1 \n",
      " 59127843f6ce173b6e22322e7f10ab82 |           1 \n",
      " 6b0259a861d01b67ff7d9d323569e022 |           1 \n",
      " 5059d375bec8f42bb1638f120d5a1e55 |           1 \n",
      " 6c50c87e36d8641d67fbcceed5cfec5e |           1 \n",
      " a2ee607f03a8f581d1625b68fbaa6166 |           1 \n",
      " dafc178b7166ee2eedeb1fccc31ad432 |           1 \n",
      " 6ef76b1a0c15eb96ed49c78d38f37b68 |           1 \n",
      " 11d5f8f3c96fff33d7e8bcbb54c8c79e |           1 \n",
      " 5ed3835ea6f96c77bdbe416dc1a96850 |           1 \n",
      " fc931a514a3e080c336911cccd59145b |           1 \n",
      " 64315bd8c0c47303179dd2e25b579d00 |           1 \n",
      " a0adc3041e9917104f3fea4ba995adcb |           1 \n",
      " d692d19cee022f7acab76373f297ad6a |           1 \n",
      " 0f0143975760d1205a4285a4e2a1bdea |           1 \n",
      " a155b4eeffbbec8a728eb1ad73705153 |           1 \n",
      " 9df634af5c467f3b07f3d92f7765aa64 |           1 \n",
      " 06bf70b6e1d67d96308235ef350edc61 |           1 \n",
      " 57d87687241f1aeb1a202f93ceccb0f3 |           1 \n",
      " 6a2909ac21d16b721e4795e7e8ff3e68 |           1 \n",
      " c8df81dfad2ad37b2194a2798ec06bce |           1 \n",
      " cec09725da5ed01471d9a505e7389d37 |           1 \n",
      " f6a00327e33d86dea4cd7175577dd8b9 |           1 \n",
      " 492bfd5c7a82cfd6dddccdec443b2ca4 |           1 \n",
      " ad938d3b79856582ace5b311ab864826 |           1 \n",
      " 42f25a7251d847a86c1849731bf166ff |           1 \n",
      " e4d325bd1eea550509bdbbc5c3301fc1 |           1 \n",
      " dfaa4aa108d9f919df2f99b86d45cb13 |           1 \n",
      " 0d5837a2580f92e18e2d1b5f7fa70c2d |           1 \n",
      " c92f0e7b9d49a9543558d6532772441b |           1 \n",
      " b73091f98b819cf7a339f74ece86aa4b |           1 \n",
      " 8ae2a62356fe10b4261e16268508ddb5 |           1 \n",
      " c9fa6a0dbc5b979d8c99f38c3c9c912f |           1 \n",
      " 6a09d996beaebffe169f70c614ac2485 |           1 \n",
      " c230b471b7e21ff9060e68ee154afd70 |           1 \n",
      " 5e80fe2cee2f6de9a494047ed35a2fe3 |           1 \n",
      " 158102fe543dbaeb84d87811bfe06d0d |           1 \n",
      " 8af72bbf3875865c7fc23509cf49682e |           1 \n",
      " 20d672f52195d2c20168f758a77303d6 |           1 \n",
      " 17f6a6d7f6e0334b28d8d026d12db169 |           1 \n",
      " 48f45fb4d7e27353b8abef59be38b65e |           1 \n",
      " a270b2f4aad055863b643395b987d151 |           1 \n",
      " a4c1d75f5db22319df894cf3f4609b81 |           1 \n",
      " ff5ecb2f7628793844e861076ab8e467 |           1 \n",
      " 2423252b2432f1803e4f29e0974c6cf7 |           1 \n",
      " de984954e2e130136bcf8988bc973d90 |           1 \n",
      " eb7172d8a3c64298d2d767f6603c231e |           1 \n",
      " 126289ccc36b3b564a105f620f48747e |           1 \n",
      " 5b8423dc7f23089c9c59c5d140eb5a1c |           1 \n",
      " b980f3256c981fc178514325143b1fc8 |           1 \n",
      " 3d0552899dbe2f89cff6197aab33fe99 |           1 \n",
      " 3fca280b9c1738d8d7996c7373d3ecee |           1 \n",
      " 261244fc4d0197d8772346872f5b0f5e |           1 \n",
      " 34b61264ecf24043cc09e6f4dbf6c0f4 |           1 \n",
      " ee4007b2b6a389f76918b093ff7b6523 |           1 \n",
      " 38bd9bace6634c6a98f17942fb637acf |           1 \n",
      " 8844bd4b8ca8f93603694ca2bceb77e9 |           1 \n",
      " 47376be1404bbe927766e8a9011714cb |           1 \n",
      " b3bce4552b02817249347cc257c9e61a |           1 \n",
      " 3b42242085259cb66b6e577ae5173c76 |           1 \n",
      " 7fa1ba3a83d923bea1b21e52ba66b384 |           1 \n",
      " 083178fd17a5d863811733e46fc529ef |           1 \n",
      " 28bdd20184e553872bab0ae75bbcaecf |           1 \n",
      " 1a300f482e35d7eac74b229be067aefd |           1 \n",
      " ebf7d9b8166c02eb72e573eebd630458 |           1 \n",
      " 18796df281656da4036dd926561a6030 |           1 \n",
      " 25e2023ed83352bde98dc1490d14c3d8 |           1 \n",
      " 1e919b41a2e4b6055b2498c100e18c75 |           1 \n",
      " 0e362037e5f02f62c8ce89f49cb9d520 |           1 \n",
      " 167b4b8c4bd0c401bea62f5e050d70a4 |           1 \n",
      " 2345a354a6f2033609bbf62bf5be9ef6 |           1 \n",
      " 37246960437c4a40a03c40f0ea2e957c |           1 \n",
      " 3321ad579f19476d0d668f726f8dffec |           1 \n",
      " 36f60d45225e60c7da4558b070ce4b60 |           1 \n",
      " c8a4ec6d4201d92e157eafb89eab932b |           1 \n",
      " 1ac09f60f3c3bc2021c637ef23fa3248 |           1 \n",
      " 6bf5b542b699bd09889aeb3917464f49 |           1 \n",
      " 1a43e86fd17dcec91ec053c9a1adeaac |           1 \n",
      " 0fce35c0b7338bda3e52e2389f0c0762 |           1 \n",
      " 5cb9696a7256c0bd3fa974570c74a13d |           1 \n",
      " fcaab5d7f656094e49fbe4ee3a506658 |           1 \n",
      " d04857e7b4b708ee8b8b9921163edba3 |           1 \n",
      " d9880e15196711e7f9fe7dabc5f74117 |           1 \n",
      " 9ad75bd7267e5c724cb42c71ac56ca72 |           1 \n",
      " 49cd59957f1c81427ca0b2edf5696969 |           1 \n",
      " 79792fabf714677e94472c3ce5e719a5 |           1 \n",
      " af144ed65466a16118af719a57053c95 |           1 \n",
      " ba9f160a6ae1c23f25d690fd06fe4fd8 |           1 \n",
      " 81825b8f118d301ef4933de64545b307 |           1 \n",
      " b56d201af4e494d64897a4be5bb6782b |           1 \n",
      " 9bc7d25a36d620cf449cfdebe3de132f |           1 \n",
      " 96ea4f32befa14bd8ab36fd6827a5e3f |           1 \n",
      " bf477d995ee4444807afc574cfbcc1c1 |           1 \n",
      " 54716da70a63aba6d2edb21f14d75e31 |           1 \n",
      " f71f42e2381752836563b70beb542f80 |           1 \n",
      " 657247f6f60543b93e3cc708a8e6329c |           1 \n",
      " 89a85fb039d401c099e30c569a6f2e07 |           1 \n",
      " 073ed404e3aec5b0a486334c05ee2fe9 |           1 \n",
      " 79366d6a24de9351b7ca6e3cf75a68ec |           1 \n",
      " 22f49044bc3eaead7cadfb045391582f |           1 \n",
      " 1ae2f20ff728b72bc2d6359978de7328 |           1 \n",
      " b7605b5b483063d12bd90a772bff9d21 |           1 \n",
      " 8adde8ed66e628e94f29b9832156ab08 |           1 \n",
      " 12a146749cb72ebfde01a89105df1897 |           1 \n",
      " 363218ba55c610b750224f90bdd34be1 |           1 \n",
      " e70cbdacbd8a00d59dfabfbd53d84091 |           1 \n",
      " 250ac1c9c91aa7b446a4fa9ff67190f8 |           1 \n",
      " cb92637d91f8267856d2143b6fc7bd9e |           1 \n",
      " f3ae4b9a1e86b6295ee5b21dd0943692 |           1 \n",
      " 481aad97c80d6786a7c6096991003274 |           1 \n",
      " 822c9ab05e9b8114704a5b2cd8639585 |           1 \n",
      " 0b5c6dd6ca91fd2a318e99749b0ea57d |           1 \n",
      " 8e312c483d79e02dbc1d68cce77e26c8 |           1 \n",
      " 44a34214a57dc373dcd80f54c919d006 |           1 \n",
      " d7d0c5e4a7f509a4c980aae1530e3bc4 |           1 \n",
      " 6e77b89d36e50217e6793780a8ce5c82 |           1 \n",
      " 0816234aa8a9ed73333cc61afb578bd1 |           1 \n",
      " 3c3e5e9de1f81dc29a6a8bc3e0fff6c0 |           1 \n",
      " 163e6400e6dadd0fe04775c5e9331fda |           1 \n",
      " a04f52ded97b5530e8783e3c002b90f0 |           1 \n",
      " a2a1d57880bb40e60b59530ba0177ccf |           1 \n",
      " 163da86e86f0089de089399c28c3fcbb |           1 \n",
      " 5131368354b35ed441caa8ca27244f16 |           1 \n",
      " 1dceebcc5f23c02ea23e16d5bedca000 |           1 \n",
      " 89321f94e35fc6d7903d36f74e351d40 |           1 \n",
      " c224f464aeeb2c6af33f0682a181efa7 |           1 \n",
      " c1af2dbb7ddaa89a57094a6fde7578bf |           1 \n",
      " 31c3ba56d23b5c48856647e06a115738 |           1 \n",
      " 170b033abb14ccc92a21b95dba58fa90 |           1 \n",
      " fef7934cc233ee5b1dc13094d98a1465 |           1 \n",
      " 33fca9d59532dd4c191217a979346ab9 |           1 \n",
      " 0820af09ddc75b84841b1fab4da4be9b |           1 \n",
      " 5d096ee78b3150e1dcab797e13884824 |           1 \n",
      " 50a507147f39a8d8ad52ee1982e20673 |           1 \n",
      " 22c5ddc22ea8cae84fc9917def682dc6 |           1 \n",
      " 7d854ab97c64ef9df2bbfaf332765786 |           1 \n",
      " 869e769127ff8442f28e7e782ae62d8f |           1 \n",
      " ab9aa96e13784729bde0fddf698eb1e1 |           1 \n",
      " ce6f74096c84567f22728c84f3d6e7fc |           1 \n",
      " b10eba910a974df70b8a12d0665cdb9e |           1 \n",
      " e073574bfbfbdfbe59454d8474cad673 |           1 \n",
      " 83d199d296c44101c8c3b5c9c0cce9ea |           1 \n",
      " 8c591ab0ca519558779df02023177f44 |           1 \n",
      " f95dcd7b0926e47d0f20a9050aea2e9e |           1 \n",
      " 964dd0fcba2ca4eff8e31ec74a77d41d |           1 \n",
      " de1eee6c50298db6028af08bd88a702a |           1 \n",
      " 72ca7a219f9f5b1be88c79e3aedd0152 |           1 \n",
      " ba453af64b21e4179a5635683be46d15 |           1 \n",
      " 95882ad7734c1fb14cf538cf382b792d |           1 \n",
      " 2ce9227f31dd89541bd4b89d835e9056 |           1 \n",
      " 3aa3fb2fdb16c7383879e48a574fc8ab |           1 \n",
      " 6d33559681ad82d2e835b1cb587d2ce3 |           1 \n",
      " 76fffd0056ad48fbddac939c05e05cff |           1 \n",
      " 3e442d09f9dfef002aadf31960869f65 |           1 \n",
      " efdc6e0a04b68a8c329d485ab2bde52e |           1 \n",
      " c8c073a1cae6a98799d7581958ede514 |           1 \n",
      " eb8c629f70275fd1c4f809116cce1efc |           1 \n",
      " c211ff3068fcd2f8898192976d8b3a32 |           1 \n",
      " cd98dfe8c9e4a7e14da489ba34f3a845 |           1 \n",
      " c8cfa622661e047ea2499f8bce4731a5 |           1 \n",
      " 57eea82fdaafa70e1bda51d338583f9b |           1 \n",
      " 5176d8670222d50ebbe4d4c5dfba2b49 |           1 \n",
      " 5d61fa9714218b033b42ca6cbf0f2570 |           1 \n",
      " 0d9cceec564febe77a44f8123dc2279b |           1 \n",
      " 5af8f974918d5e68bc22ea894296adb6 |           1 \n",
      " d363e421b1d15376b299089946fed127 |           1 \n",
      " 693e8a3550dfe12cd2a3f2a3f01b6130 |           1 \n",
      " 610c673331ac3c4fa0f393ce5af9aa2e |           1 \n",
      " 7fd5ed44c2c119be619555591475b233 |           1 \n",
      " 9feeadd6b97835152e83e1b25b46f5c4 |           1 \n",
      " 7ff398be53b9d0ce7eb2b2e934696b15 |           1 \n",
      " 715ff1d94c99db18163cae1eb40f9bb0 |           1 \n",
      " 528dac9e82a36e6b5150d263d1bdaaa9 |           1 \n",
      " 6e6760cb4ddc324d319cf599ce8a8b89 |           1 \n",
      " b217a380fe548cd65a8d6f18a9c0eb28 |           1 \n",
      " 31c8ebd6dc2e12cfd9fde8eeaa32f36a |           1 \n",
      " a54244559e62c8ef2939e52189d65d4c |           1 \n",
      " bed9b7934576c9ba61b6ba6f3babc698 |           1 \n",
      " fff0a542c3c62682f23305214eaeaa24 |           1 \n",
      " 86ecc269de40ba13205e7beeee12f26f |           1 \n",
      " f5badee8a0e679f057ec0ca4f0f32dcb |           1 \n",
      " 53f721e1c5d5cd3825979a5556593dad |           1 \n",
      " d272d0921188b0bd91542d704b21404e |           1 \n",
      " e62b2ce29dae5ba4170e4c5cb5d57e58 |           1 \n",
      " 75c06ee06b201f9b6301d2b5e72993f8 |           1 \n",
      " 9bb8ca338e5588c361e34eae02e8fad6 |           1 \n",
      " f74ed500ab93d12ce3fbc611474d89af |           1 \n",
      "\n"
     ]
    }
   ],
   "source": [
    "# produtos mais vendidos de uma cidade\n",
    "command = \"\"\"\n",
    "MATCH (cidade:Cidade)\n",
    "WHERE cidade.id = \"sao paulo\"\n",
    "MATCH (reg)-[:EH_PARTE_DE]->(cid)\n",
    "WHERE cid.id = cidade.id\n",
    "MATCH (cli)-[:MORA]->(regAux)\n",
    "WHERE regAux.id = reg.id\n",
    "MATCH (pro)-[:FOI_COMPRADO_POR]->(cliAux)\n",
    "WHERE cliAux.id = cli.id\n",
    "WITH pro.id AS product, COUNT(cliAux) as qtdeProduto\n",
    "RETURN product, qtdeProduto\n",
    "ORDER BY qtdeProduto DESC\n",
    "\"\"\"\n",
    "result = graph.run(command)\n",
    "\n",
    "print(result.to_table())\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " categoria                                      | qtdeProduto \n",
      "------------------------------------------------|-------------\n",
      " cama_mesa_banho                                |          93 \n",
      " esporte_lazer                                  |          84 \n",
      " moveis_decoracao                               |          68 \n",
      " beleza_saude                                   |          61 \n",
      " brinquedos                                     |          60 \n",
      " relogios_presentes                             |          52 \n",
      " utilidades_domesticas                          |          51 \n",
      " informatica_acessorios                         |          39 \n",
      " automotivo                                     |          37 \n",
      " perfumaria                                     |          32 \n",
      " papelaria                                      |          30 \n",
      " cool_stuff                                     |          28 \n",
      " telefonia                                      |          27 \n",
      " ferramentas_jardim                             |          26 \n",
      "                                                |          23 \n",
      " eletronicos                                    |          21 \n",
      " consoles_games                                 |          20 \n",
      " fashion_bolsas_e_acessorios                    |          18 \n",
      " bebes                                          |          17 \n",
      " pet_shop                                       |           9 \n",
      " eletroportateis                                |           8 \n",
      " malas_acessorios                               |           8 \n",
      " construcao_ferramentas_construcao              |           6 \n",
      " bebidas                                        |           5 \n",
      " moveis_escritorio                              |           5 \n",
      " casa_conforto                                  |           3 \n",
      " audio                                          |           3 \n",
      " eletrodomesticos                               |           3 \n",
      " instrumentos_musicais                          |           3 \n",
      " moveis_cozinha_area_de_servico_jantar_e_jardim |           3 \n",
      " moveis_colchao_e_estofado                      |           3 \n",
      " alimentos_bebidas                              |           3 \n",
      " casa_construcao                                |           2 \n",
      " moveis_sala                                    |           2 \n",
      " tablets_impressao_imagem                       |           2 \n",
      " market_place                                   |           2 \n",
      " alimentos                                      |           2 \n",
      " artes                                          |           1 \n",
      " livros_importados                              |           1 \n",
      " fashion_calcados                               |           1 \n",
      " agro_industria_e_comercio                      |           1 \n",
      " sinalizacao_e_seguranca                        |           1 \n",
      " livros_interesse_geral                         |           1 \n",
      " telefonia_fixa                                 |           1 \n",
      " industria_comercio_e_negocios                  |           1 \n",
      " construcao_ferramentas_seguranca               |           1 \n",
      " fashion_underwear_e_moda_praia                 |           1 \n",
      " cds_dvds_musicais                              |           1 \n",
      " eletrodomesticos_2                             |           1 \n",
      "\n"
     ]
    }
   ],
   "source": [
    "# categorias mais vendidas em uma cidade\n",
    "command = \"\"\"\n",
    "MATCH (cidade:Cidade)\n",
    "WHERE cidade.id = \"sao paulo\"\n",
    "MATCH (reg)-[:EH_PARTE_DE]->(cid)\n",
    "WHERE cid.id = cidade.id\n",
    "MATCH (cli)-[:MORA]->(regAux)\n",
    "WHERE regAux.id = reg.id\n",
    "MATCH (pro)-[:FOI_COMPRADO_POR]->(cliAux)\n",
    "WHERE cliAux.id = cli.id\n",
    "MATCH (proAux)-[:POSSUI]->(cat)\n",
    "WHERE proAux.id = pro.id\n",
    "WITH cat.id AS categoria, COUNT(pro) as qtdeProduto\n",
    "RETURN categoria, qtdeProduto\n",
    "ORDER BY qtdeProduto DESC\n",
    "\"\"\"\n",
    "\n",
    "result = graph.run(command)\n",
    "\n",
    "\n",
    "print(result.to_table())\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " city                  | qtdeProduto \n",
      "-----------------------|-------------\n",
      " sao paulo             |         871 \n",
      " rio de janeiro        |         418 \n",
      " belo horizonte        |         184 \n",
      " brasilia              |         133 \n",
      " salvador              |          95 \n",
      " campinas              |          86 \n",
      " curitiba              |          81 \n",
      " porto alegre          |          72 \n",
      " guarulhos             |          64 \n",
      " niteroi               |          54 \n",
      " sao bernardo do campo |          52 \n",
      " santo andre           |          50 \n",
      " sao jose dos campos   |          49 \n",
      " santos                |          47 \n",
      " fortaleza             |          43 \n",
      " recife                |          42 \n",
      " sao goncalo           |          40 \n",
      " goiania               |          39 \n",
      " osasco                |          38 \n",
      " sorocaba              |          38 \n",
      " ribeirao preto        |          35 \n",
      " belem                 |          34 \n",
      " jundiai               |          30 \n",
      " mogi das cruzes       |          29 \n",
      " uberlandia            |          29 \n",
      "\n"
     ]
    }
   ],
   "source": [
    "# cidades que venderam mais produtos\n",
    "command = \"\"\"\n",
    "MATCH (cidade:Cidade)\n",
    "MATCH (reg)-[:EH_PARTE_DE]->(cid)\n",
    "WHERE cid.id = cidade.id\n",
    "MATCH (cli)-[r:MORA]->(regAux)\n",
    "WHERE regAux.id = reg.id\n",
    "MATCH (pro)-[FOI_COMPRADO_POR]->(cliAux)\n",
    "WHERE cliAux.id = cli.id\n",
    "WITH cid.id as city, COUNT(pro.id) as qtdeProduto\n",
    "RETURN city, qtdeProduto\n",
    "ORDER BY qtdeProduto DESC\n",
    "LIMIT 25\n",
    "\"\"\"\n",
    "\n",
    "result = graph.run(command)\n",
    "\n",
    "print(result.to_table())\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " city                |    vendas \n",
      "---------------------|-----------\n",
      " sao paulo           |  418267.4 \n",
      " rio de janeiro      | 337955.72 \n",
      " belo horizonte      | 165375.42 \n",
      " brasilia            |  89549.75 \n",
      " salvador            |  79417.39 \n",
      " curitiba            |  59938.67 \n",
      " campinas            |  56264.15 \n",
      " santos              |  46434.36 \n",
      " porto alegre        |  43559.17 \n",
      " sao jose dos campos |  38976.93 \n",
      " fortaleza           |   36403.1 \n",
      " sao goncalo         |   36213.1 \n",
      " goiania             |  33612.63 \n",
      " santo andre         |  29766.74 \n",
      " guarulhos           |  28588.07 \n",
      " recife              |  25444.73 \n",
      " ribeirao preto      |  23271.97 \n",
      " niteroi             |  22057.05 \n",
      " uberlandia          |  22050.12 \n",
      " belem               |  20727.69 \n",
      " guaruja             |  20301.33 \n",
      " joao pessoa         |  20130.06 \n",
      " canoas              |  19994.31 \n",
      " sao vicente         |  18347.73 \n",
      " volta redonda       |  18254.32 \n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Cidades que apresentaram o maior volume de vendas\n",
    "command = \"\"\"\n",
    "MATCH (cidade:Cidade)\n",
    "MATCH (reg)-[:EH_PARTE_DE]->(cid)\n",
    "WHERE cid.id = cidade.id\n",
    "MATCH (cli)-[:MORA]->(regAux)\n",
    "WHERE regAux.id = reg.id\n",
    "MATCH (pro)-[:FOI_COMPRADO_POR]->(cliAux)\n",
    "WHERE cliAux.id = cli.id\n",
    "MATCH (proItem)-[:EH_DE]->(item)\n",
    "WHERE proItem.id = pro.id\n",
    "WITH cidade.id as city, SUM(item.preco) as valorVendas\n",
    "RETURN city, ROUND(valorVendas*100)/100 as vendas\n",
    "ORDER BY valorVendas DESC\n",
    "LIMIT 25\n",
    "\"\"\"\n",
    "\n",
    "result = graph.run(command)\n",
    "\n",
    "print(result.to_table())\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " city                  |  Frete \n",
      "-----------------------|--------\n",
      " caputira              | 121.22 \n",
      " confresa              | 104.31 \n",
      " madre de deus         |  87.33 \n",
      " missal                |  84.71 \n",
      " martinopolis          |  83.04 \n",
      " santa rosa de viterbo |  79.42 \n",
      " capao do cipo         |  77.92 \n",
      " sobral                |  76.29 \n",
      " taciba                |  75.37 \n",
      " grajau                |  75.37 \n",
      " sao borja             |  74.79 \n",
      " potirendaba           |  68.13 \n",
      " itapoa                |  67.19 \n",
      " tucurui               |  64.17 \n",
      " vitoria da conquista  |   60.6 \n",
      " piracuruca            |  60.56 \n",
      " gilbues               |  60.51 \n",
      " sao luis do quitunde  |  59.77 \n",
      " novo hamburgo         |  59.35 \n",
      " cuite                 |  59.35 \n",
      " sao pedro dos ferros  |  58.14 \n",
      " casimiro de abreu     |  55.45 \n",
      " peixoto de azevedo    |  54.49 \n",
      " sao miguel do guama   |  54.11 \n",
      " itirucu               |  52.81 \n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Cidades que apresentaram o maior valor medio de frete cobrado em cada venda\n",
    "command = \"\"\"\n",
    "MATCH (cidade:Cidade)\n",
    "MATCH (reg)-[:EH_PARTE_DE]->(cid)\n",
    "WHERE cid.id = cidade.id\n",
    "MATCH (cli)-[:MORA]->(regAux)\n",
    "WHERE regAux.id = reg.id\n",
    "MATCH (pro)-[:FOI_COMPRADO_POR]->(cliAux)\n",
    "WHERE cliAux.id = cli.id\n",
    "MATCH (proItem)-[:EH_DE]->(item)\n",
    "WHERE proItem.id = pro.id\n",
    "WITH cidade.id as city, AVG(item.frete) as valorFrete\n",
    "RETURN city, ROUND(valorFrete*100)/100 as Frete\n",
    "ORDER BY valorFrete DESC\n",
    "LIMIT 25\n",
    "\"\"\"\n",
    "\n",
    "result = graph.run(command)\n",
    "\n",
    "print(result.to_table())\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " city      | categoria                                      | Frete \n",
      "-----------|------------------------------------------------|-------\n",
      " sao paulo | moveis_cozinha_area_de_servico_jantar_e_jardim | 50.99 \n",
      " sao paulo | moveis_colchao_e_estofado                      | 40.98 \n",
      " sao paulo | malas_acessorios                               | 29.71 \n",
      " sao paulo | agro_industria_e_comercio                      | 26.99 \n",
      " sao paulo | eletrodomesticos_2                             | 24.15 \n",
      " sao paulo | moveis_escritorio                              | 23.85 \n",
      " sao paulo | sinalizacao_e_seguranca                        | 23.29 \n",
      " sao paulo | livros_interesse_geral                         | 22.38 \n",
      " sao paulo | cool_stuff                                     | 21.46 \n",
      " sao paulo | utilidades_domesticas                          | 21.19 \n",
      " sao paulo | ferramentas_jardim                             | 19.69 \n",
      " sao paulo | casa_construcao                                | 19.42 \n",
      " sao paulo | industria_comercio_e_negocios                  | 18.75 \n",
      " sao paulo | construcao_ferramentas_construcao              | 18.71 \n",
      " sao paulo | informatica_acessorios                         | 18.21 \n",
      " sao paulo | papelaria                                      | 17.89 \n",
      " sao paulo | eletroportateis                                | 17.56 \n",
      " sao paulo | moveis_decoracao                               | 16.96 \n",
      " sao paulo | pet_shop                                       | 16.47 \n",
      " sao paulo | esporte_lazer                                  | 16.43 \n",
      " sao paulo | brinquedos                                     | 16.32 \n",
      " sao paulo | moveis_sala                                    | 16.27 \n",
      " sao paulo | automotivo                                     | 16.24 \n",
      " sao paulo | cama_mesa_banho                                | 15.86 \n",
      " sao paulo | alimentos_bebidas                              | 15.84 \n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Cidades que apresentaram o maior valor medio de frete cobrado em cada venda\n",
    "command = \"\"\"\n",
    "MATCH (cidade:Cidade)\n",
    "WHERE cidade.id = \"sao paulo\"\n",
    "MATCH (reg)-[:EH_PARTE_DE]->(cid)\n",
    "WHERE cid.id = cidade.id\n",
    "MATCH (cli)-[:MORA]->(regAux)\n",
    "WHERE regAux.id = reg.id\n",
    "MATCH (pro)-[:FOI_COMPRADO_POR]->(cliAux)\n",
    "WHERE cliAux.id = cli.id\n",
    "MATCH (proAux)-[:POSSUI]->(cat)\n",
    "WHERE proAux.id = pro.id\n",
    "MATCH (proItem)-[:EH_DE]->(item)\n",
    "WHERE proItem.id = proAux.id\n",
    "WITH cidade.id as city, cat.id AS categoria, AVG(item.frete) as valorFrete\n",
    "RETURN city, categoria, ROUND(valorFrete*100)/100 as Frete\n",
    "ORDER BY valorFrete DESC\n",
    "LIMIT 25\n",
    "\"\"\"\n",
    "\n",
    "result = graph.run(command)\n",
    "\n",
    "print(result.to_table())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
